ajohnson-smarthome/AJMiddleCar/firmware/dongle/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The USB device class. NCM rather than ECM or RNDIS because it is the one both
# macOS and iOS are expected to accept class-compliant, and the only mode IDF's
# tusb_ncm example is built around.
CONFIG_TINYUSB_NET_MODE_NCM=y

# Console on UART0, reached through the board's second Type-C and its bridge chip.
#
# This is forced, not preferred: on ESP32-S3 the native USB pins (GPIO19/20) are muxed
# between the USB-Serial-JTAG controller and the USB-OTG controller, and only one may
# have them. TinyUSB needs USB-OTG, so the moment NCM comes up the USB console would
# disappear mid-session. Putting the console on UART0 from the start means logs never
# move.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n

# 16 MB flash with a custom table: two 4 MB OTA slots, plus a reserved data partition.
# The slots predate the OTA code by two plans — see partitions.csv for why the table is the half
# that gets decided first.
#
# Rollback is on. An image written through POST /ota boots once as PENDING_VERIFY and is reverted
# by the bootloader unless it cancels that itself; main.c cancels it at the end of app_main, after
# the HTTP server that could deliver a replacement is answering. The property this protects is
# reachability — a dongle lives in a pocket, and an image that boots but cannot serve /ota is one
# that needs a cable and a laptop to undo.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# N16R8: 16 MB flash, 8 MB PSRAM on an octal bus. Octal PSRAM occupies GPIO33-37 —
# nothing here needs them, but note it before assigning pins.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# The S3 has its own radio — unlike the P4, which has none and drives a C6 over SDIO. Nothing
# here is a co-processor; esp_wifi talks to silicon on the same die.
#
# Station only. The dongle never becomes an AP: the phone reaches it over USB, and a softAP
# would be a second radio interface for the API guard to worry about and for nobody to use.
# Disabling SoftAP support is what makes that structural rather than just a promise wifi_sta.c
# happens to keep — esp_wifi_set_mode(WIFI_MODE_STA) alone doesn't remove the AP code, this does.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# Receive buffers sized for the video relay, not for a REST trickle. The car sends a frame as
# a burst of up to ~60 datagrams of 1.4 KB, one per millisecond, and the S3 has to hold the
# burst until relay_video has copied each one out to USB. With the 8/16 this file shipped
# with (below IDF's own 10/32, from the first commit, with no reason recorded) the bench
# measured 49 % of chunks lost through the dongle against 3 % on the same air received by a
# laptop — and the loss grew with the frame's length: 7 % for frames under 8 chunks, 74–92 %
# for frames over 40. That is a receiver running out of buffers, not a radio losing frames.
# Kconfig's own help for the dynamic count names the case: "WiFi data frames may be received
# faster than the application can process them". Static 16 ≥ the BA window, as its help asks;
# dynamic 64 is one whole keyframe of headroom, in internal RAM (~26 KB static, up to ~100 KB
# dynamic, allocated on demand and freed as the relay drains) — the image leaves ~140 KB after
# static data, so this is as far as internal RAM goes. Tried and rejected: the same pools in
# PSRAM (CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP) with 128 dynamic buffers measured WORSE, 24 %
# lost against 14 % — the driver's copy into PSRAM costs more than the extra buffers buy.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_RX_BA_WIN=16
#
# Static TX buffers, stated the only way that actually takes. This line used to read
# CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1, which is a silent no-op: that symbol has no prompt and is
# derived (esp_wifi/Kconfig) from the promptable choice below it —
#   config ESP_WIFI_TX_BUFFER_TYPE
#       int
#       default 0 if ESP_WIFI_STATIC_TX_BUFFER
#       default 1 if ESP_WIFI_DYNAMIC_TX_BUFFER
# — so kconfiglib recomputes it from the choice and discards whatever was written here,
# without a warning. Whichever value was written here, the choice below decided the outcome.
#
# Static, because the bench said so. The choice's help says "If PSRAM is enabled, 'Static'
# should be selected to guarantee enough WiFi TX buffers", and PSRAM is enabled here. This
# file used to keep Dynamic anyway, reasoning that the dongle's Wi-Fi carries relayed REST
# and a 10 Hz control stream rather than the sustained bulk TX that advice is aimed at. That
# reasoning was wrong, and the failure it caused was expensive to read: with Dynamic, EVERY
# packet the relays sent toward the car failed with errno 12 (ENOMEM) and TCP connects timed
# out, while the dongle itself looked perfectly healthy — associated, addressed, both relays
# bound, its own /status answering. The heap was not exhausted (230 KB internal free, 152 KB
# largest block) and routing was correct (ip4_route picked the station netif). The refusal
# came from below lwIP: esp_wifi_internal_tx could not get a DMA-capable buffer, wlanif's
# low_level_output turned that into ERR_MEM, and the socket layer surfaced it as ENOMEM.
# Flipping this one choice took the relayed /status from a 5 s timeout to a 0.49 s 200, and
# the whole rt conformance suite from unreachable to passing.
#
# So: do not "simplify" this back to Dynamic. With PSRAM on, Dynamic does not merely risk
# exhaustion under load — on this board it never transmits at all.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# The relays forward between two interfaces, so lwIP must be willing to hold more sockets than
# a single-purpose device needs. Worst-case budget, one line per consumer:
#
#   httpd (status_api.c, :8080): 3 internal sockets + max_open_sockets(3, lowered from
#     esp_http_server's default of 7 in status_api.c, since this is an admin API, not proxied
#     REST traffic) = 6. Three, not two: httpd_start's own comment enumerates listen_fd, the
#     UDP socket it SENDS control messages on (msg_fd) and the one it RECEIVES them on
#     (ctrl_fd), and states "the total number of required sockets is max_open_sockets + 3".
#     It enforces that too — httpd_start returns ESP_ERR_INVALID_ARG when
#     CONFIG_LWIP_MAX_SOCKETS is smaller.
#   relay_udp.c (:4210): 1 phone-facing socket + UDP_SESS_MAX(4) car-facing sockets = 5
#   relay_udp.c (:4211): the video instance of the same task, same arithmetic = 5
#   relay_tcp.c (:80): 1 listener + RELAY_POOL_SIZE(4) slots x 2 sockets each
#     (phone_sock + car_sock, held whether a slot is SLOT_CONNECTING or SLOT_ACTIVE) = 9
#
# Steady-state worst case: 6 + 5 + 5 + 9 = 25, so 32 leaves 7 sockets of headroom. The true
# instantaneous peak is 26: relay_tcp's handle_accept accepts a connection BEFORE it looks for
# a free slot, so with the pool already full it briefly holds a twenty-sixth socket between
# accept() and the close() that refuses it. That is deliberate — refusing a full pool by
# closing beats hanging a client on an unaccepted connection — and 32 covers it. Cheap to raise
# again if any of the four consumers above grows. (Before task-5's review this value was 16,
# four short of the 20 of that day's total and five short of that day's peak; an earlier
# version of this comment put that shortfall at seven, which was wrong twice over. Before
# task-8's review it was 24 — right for three consumers, one relay_udp.c instance short of
# the fourth this task added.)
CONFIG_LWIP_MAX_SOCKETS=32

# Room for one whole keyframe on the way to the phone. lwIP's per-socket mailbox and
# TinyUSB's NCM transfer pool are the two places a burst is dropped silently — sized to
# ~100 KB between them, so the car's pacing (one chunk per millisecond) is the only limit
# that matters. ~60 KB of RAM; the S3 has PSRAM to spare.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
# A 1 kHz tick. Everything this device does is relaying at millisecond pace: select() timeouts
# in the relays, the USB transmit task's wait for a free transfer block (~6 ms apart), the
# rate gate's clock. At IDF's default 100 Hz a one-tick wait is 10 ms, and the USB path
# measured 3.9 Mbit/s where the same link carries 6 with the tick at 1 ms (bench, 2026-09-16).
CONFIG_FREERTOS_HZ=1000
# The tcpip thread's own mailbox sits in front of the socket's: every received frame passes
# through it first, and at one datagram per millisecond IDF's default of 32 is thirty-two
# milliseconds of the tcpip thread being busy elsewhere (USB, the other relay) before frames
# are dropped where nothing counts them. 64 is Kconfig's ceiling for both mailboxes without
# window scaling — a value above it is silently replaced by the DEFAULT (6 for the socket's),
# which is how a first draft of this change shipped a smaller mailbox than it removed.
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_TINYUSB_NCM_IN_NTB_BUFFS_COUNT=6
# 8128, not 10240 — and never more. The S3's DWC2 core counts packets in 7 bits (GHWCFG3), so
# one bulk transfer may hold at most 127 × 64 = 8128 bytes; TinyUSB 0.21's DCD programs a
# transfer block whole, and a block past that limit is consumed by the core without a
# transfer-complete event — the endpoint stays busy for good, nothing crosses the wire in
# either direction, and only a bus reset from the host (or a replug) recovers it
# (hathach/tinyusb#3825, open). A 10240-byte ceiling let six 1.4 KB video chunks glue into an
# 8792-byte block, which is exactly the block the bench (2026-09-15, NCM driver trace) saw
# queued and never completed, every time the stream passed ~2 Mbit/s. Capped, the same bench
# carried 6.3 Mbit/s with 99 % of chunks whole. The OUT side's 3200 is under the limit already.
CONFIG_TINYUSB_NCM_IN_NTB_BUFF_MAX_SIZE=8128
